public class MyStory {
    public String getMyStory(){
        return "Здравствуйте, в недалеком будющеем я вижу себя, как человека который способен на все возможные путешествия не тольео по нашей большой и необьятной стране, но и в зарубежные старны, моя мечта это поситить францию. Програмированние хоть и невероятно востребованная проффесия, но и без програмированния можно обойтись, изначально я хотел очень сильео поступить на информационную безопасность, но увы, звезды не сошлись, в следсвтии чего для меня открылась дургая интересная проффесия аналогов в России в данной отрасли нету, поэтому она была для меня очень интерсна, но полсе всех событий в мире в 2022 году, мне прищлось вернустся в Россию, где меня заинтересовала такая специалезация как Гейм-дизайнер, если бы не вышеупомянутые события, скорее всего я бы и дальше обучался на ту професию и скорее всего програмированние мне бы не пригодилось.  ";
    }
}
